---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.AssemblyDifferenceNamingCategory
source: html/22a26549-a872-d135-5eeb-698e8255c512.htm
---
# AssemblyDifferenceNamingCategory Members

Specifies whether the .NET object represents a valid Revit entity.